[
    {"body": "Congratulations! You've won a FREE vacation to Hawaii! Click here to claim your prize now!", "email": "prizes@freemail.com"},
    {"body": "Monthly sales report attached for your review. Let me know if you need any further information.", "email": "manager@companymail.com"},
    {"body": "Get your limited time offer now! Special discounts available only this weekend. Don't miss out!", "email": "promo@spamdomain.org"},
    {"body": "Project update: Please see the attached document for the latest progress on the deliverables due.", "email": "teammember@workmail.com"},
    {"body": "URGENT: Your account may have been compromised. Please update your password immediately for security!", "email": "support@freemail.com"},
    {"body": "Join us for the annual charity run! Help make a difference and register today to support a cause.", "email": "events@charity.com"},
    {"body": "Win an exclusive prize! Click here for your chance to win big in our latest sweepstakes and offers!", "email": "offers@discountmail.com"},
    {"body": "Reminder: Team meeting scheduled for 10 AM tomorrow in the main conference room. Don't be late!", "email": "hr@companymail.com"},
    {"body": "LIMITED OFFER: Get 50% off on all items in our store! This offer ends tonight, so act fast!", "email": "deals@spamdomain.org"},
    {"body": "Thank you for your recent purchase. Your order will be shipped within 3-5 business days. Enjoy!", "email": "orders@storemail.com"},
    {"body": "Special FREE gift just for you! Don't wait, claim your gift now before it runs out and stocks end!", "email": "gifts@freemail.com"},
    {"body": "Please find the Q4 financial summary report attached. Let me know if you have any questions or concerns.", "email": "finance@workmail.com"},
    {"body": "Urgent action required: Verify your account to prevent suspension. Act now and keep your access!", "email": "security@spamdomain.org"},
    {"body": "Your account statement is ready for viewing. Log in to access your monthly summary and details.", "email": "accounts@bankmail.com"},
    {"body": "Congratulations on winning! Click here to claim your prize within 24 hours to secure your gift!", "email": "winner@discountmail.com"},
    {"body": "Let's schedule a meeting next week to discuss the upcoming project milestones and deadlines.", "email": "colleague@workmail.com"},
    {"body": "Introducing our new product line! Explore the latest innovations and special introductory pricing.", "email": "marketing@company.com"},
    {"body": "FINAL NOTICE: Your invoice is overdue. Pay now to avoid additional fees and service disruption.", "email": "billing@companymail.com"},
    {"body": "Don't miss out on our big sale! Everything must go, with prices slashed up to 70% off storewide!", "email": "sales@discountmail.com"},
    {"body": "Join our webinar on financial planning strategies! Reserve your spot today and learn valuable tips.", "email": "webinars@education.com"},
    {"body": "You have received a payment of $1000. Check your account for details and transaction history.", "email": "payments@bankmail.com"},
    {"body": "Hurry! Last chance to enter our sweepstakes for a brand new car. Click to enter before time runs out!", "email": "sweepstakes@freemail.com"},
    {"body": "Your subscription is about to expire. Renew now to continue enjoying our premium services uninterrupted.", "email": "subscriptions@service.com"},
    {"body": "Friendly reminder: Your project deadline is approaching. Ensure all tasks are completed on time.", "email": "projectmanager@company.com"},
    {"body": "Exciting news! We've upgraded our system. Log in now to see all the new features and improvements!", "email": "updates@service.com"},
    {"body": "We appreciate your feedback! Please take a moment to complete our survey and help us improve.", "email": "feedback@companymail.com"},
    {"body": "Important update regarding your account. Please read this message to stay informed about changes.", "email": "info@service.com"},
    {"body": "You are invited to our exclusive event! RSVP now to secure your place at this prestigious gathering.", "email": "events@company.com"},
    {"body": "Discover amazing deals on electronics! Limited stock available, shop now to take advantage of these offers!", "email": "sales@freemail.com"},
    {"body": "Get a FREE trial of our premium membership! Experience all the benefits at no cost for 30 days!", "email": "trial@service.com"},
    {"body": "Don't let this opportunity pass! Invest in your future with our financial planning services today.", "email": "investments@service.com"},
    {"body": "Your friend has referred you! Get a discount on your next purchase when you sign up through this link.", "email": "referrals@discountmail.com"},
    {"body": "URGENT: Your account needs verification. Click here to secure your information and access your account.", "email": "alerts@spamdomain.org"},
    {"body": "You have been selected for a special promotion! Claim your reward before it expires this weekend.", "email": "promotions@company.com"},
    {"body": "Thank you for attending our event! We hope you found it valuable. Please provide your feedback.", "email": "events@company.com"},
    {"body": "Limited time offer: Buy one, get one free on select items! Don't miss out on this great deal.", "email": "deals@freemail.com"},
    {"body": "Congratulations on your new job! We are thrilled to welcome you aboard. Please complete your onboarding.", "email": "hr@company.com"},
    {"body": "Monthly newsletter: Stay updated with the latest news and events happening in our community.", "email": "newsletter@company.com"},
    {"body": "Your order has been shipped! Track your package using the link provided for your convenience.", "email": "shipping@storemail.com"},
    {"body": "You're invited! Join us for a special webinar on health and wellness tips for a better lifestyle.", "email": "health@service.com"},
    {"body": "Last chance! Our biggest sale of the year ends soon. Don't miss the opportunity to save big!", "email": "sales@discountmail.com"},
    {"body": "Important: Your password will expire soon. Please change your password to maintain account security.", "email": "support@service.com"},
    {"body": "You have a new message from your manager. Please log in to review the details at your earliest convenience.", "email": "manager@company.com"},
    {"body": "Congratulations! You've been selected to receive a special gift! Claim it before it's too late!", "email": "gift@freemail.com"},
    {"body": "We value your opinion! Participate in our survey for a chance to win a $100 gift card!", "email": "survey@discountmail.com"},
    {"body": "Don't miss this opportunity to enhance your skills! Sign up for our training sessions today.", "email": "training@service.com"},
    {"body": "You have a new bill available for review. Please log in to your account to view the details.", "email": "billing@companymail.com"},
    {"body": "Claim your exclusive discount today! Limited stock available on popular items, act now!", "email": "deals@spamdomain.org"}
  ]  